## pandas.read_csv

pandas.read_csv(filepath_or_buffer, *, sep=_NoDefault.no_default, delimiter=None, header='infer', names=_NoDefault.no_default, index_col=None, usecols=None, dtype=None, engine=None, converters=None, true_values=None, false_values=None, skipinitialspace=False, skiprows=None, skipfooter=0, nrows=None, na_values=None, keep_default_na=True, na_filter=True, verbose=False, skip_blank_lines=True, parse_dates=None, infer_datetime_format=_NoDefault.no_default, keep_date_col=False, date_parser=_NoDefault.no_default, date_format=None, dayfirst=False, cache_dates=True, iterator=False, chunksize=None, compression='infer', thousands=None, decimal='.', lineterminator=None, quotechar='"', quoting=0, doublequote=True, escapechar=None, comment=None, encoding=None, encoding_errors='strict', dialect=None, on_bad_lines='error', delim_whitespace=False, low_memory=True, memory_map=False, float_precision=None, storage_options=None, dtype_backend=_NoDefault.no_default)[source]

- Read a comma-separated values (csv) file into DataFrame.

- Also supports optionally iterating or breaking of the file into chunks.

In [1]:
import pandas as pd;
import numpy as np;
from io import StringIO

In [2]:
data = "Name, marks \n abbas, 90 \n khalid, 89 \n waqas, 78";

file = StringIO(data);

In [3]:
df = pd.read_csv(file)

In [4]:
df

      Name   marks
0    abbas       90
1   khalid       89
2    waqas       78

In [55]:
# Reading file from Local Disk
df = pd.read_csv(r'C:\Users\ABBAS\Desktop\JupyterPython\CSV_Files\train_and_test2.csv');

In [25]:
df

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1305,1306,39.0,108.9000,1,0,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,0
1306,1307,38.5,7.2500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1307,1308,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1308,1309,28.0,22.3583,0,1,0,0,0,0,0,...,0,0,0,3,0,0,0.0,0,0,0

In [26]:
df.head()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [27]:
df.tail()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
1304,1305,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1305,1306,39.0,108.9000,1,0,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,0
1306,1307,38.5,7.2500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1307,1308,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1308,1309,28.0,22.3583,0,1,0,0,0,0,0,...,0,0,0,3,0,0,0.0,0,0,0

In [28]:
df.head(1)

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.25,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [29]:
df.head(10)

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
5,6,28.0,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0
6,7,54.0,51.8625,0,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
7,8,2.0,21.0750,0,3,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
8,9,27.0,11.1333,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
9,10,14.0,30.0708,1,1,0,0,0,0,0,...,0,0,0,2,0,0,0.0,0,0,1

In [30]:
df.tail(3)

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
1306,1307,38.5,7.2500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1307,1308,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1308,1309,28.0,22.3583,0,1,0,0,0,0,0,...,0,0,0,3,0,0,0.0,0,0,0

In [31]:
df.shape

(1309, 28)

In [32]:
df.iloc[0:10, 0:4]

   Passengerid   Age     Fare  Sex
0            1  22.0   7.2500    0
1            2  38.0  71.2833    1
2            3  26.0   7.9250    1
3            4  35.0  53.1000    1
4            5  35.0   8.0500    0
5            6  28.0   8.4583    0
6            7  54.0  51.8625    0
7            8   2.0  21.0750    0
8            9  27.0  11.1333    1
9           10  14.0  30.0708    1

In [33]:
df[1:10]

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
5,6,28.0,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0
6,7,54.0,51.8625,0,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
7,8,2.0,21.0750,0,3,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
8,9,27.0,11.1333,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
9,10,14.0,30.0708,1,1,0,0,0,0,0,...,0,0,0,2,0,0,0.0,0,0,1

In [34]:
df.loc[2:4, 'Age':'Sex']

    Age    Fare  Sex
2  26.0   7.925    1
3  35.0  53.100    1
4  35.0   8.050    0

In [36]:
df[['Passengerid','Age','Sex', 'zero', 'zero.1']]

      Passengerid   Age  Sex  zero  zero.1
0               1  22.0    0     0       0
1               2  38.0    1     0       0
2               3  26.0    1     0       0
3               4  35.0    1     0       0
4               5  35.0    0     0       0
...           ...   ...  ...   ...     ...
1304         1305  28.0    0     0       0
1305         1306  39.0    1     0       0
1306         1307  38.5    0     0       0
1307         1308  28.0    0     0       0
1308         1309  28.0    0     0       0

[1309 rows x 5 columns]

In [39]:
df[df['Age']>50]

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
6,7,54.0,51.8625,0,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
11,12,58.0,26.5500,1,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
15,16,55.0,16.0000,1,0,0,0,0,0,0,...,0,0,0,2,0,0,2.0,0,0,1
33,34,66.0,10.5000,0,0,0,0,0,0,0,...,0,0,0,2,0,0,2.0,0,0,0
54,55,65.0,61.9792,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1247,1248,59.0,51.4792,1,2,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
1265,1266,54.0,81.8583,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
1269,1270,55.0,50.0000,0,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
1278,1279,57.0,13.0000,0,0,0,0,0,0,0,...,0,0,0,2,0,0,2.0,0,0,0
1282,1283,51.0,39.4000,1,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0

In [42]:
df[df['Fare']<=10]

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
5,6,28.0,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0
12,13,20.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1301,1302,28.0,7.7500,1,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0
1303,1304,28.0,7.7750,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1304,1305,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1306,1307,38.5,7.2500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1307,1308,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [43]:
df.iloc[1:5, 5:9]

   zero  zero.1  zero.2  zero.3
1     0       0       0       0
2     0       0       0       0
3     0       0       0       0
4     0       0       0       0

In [46]:
df.loc[1:3, 'zero':'zero.3']

   zero  zero.1  zero.2  zero.3
1     0       0       0       0
2     0       0       0       0
3     0       0       0       0

In [58]:
df.loc[1,'Age']

38.0

In [60]:
df['Age']

0       22.0
1       38.0
2       26.0
3       35.0
4       35.0
        ...
1304    28.0
1305    39.0
1306    38.5
1307    28.0
1308    28.0
Name: Age, Length: 1309, dtype: float64

In [61]:
df['Age'][0]

22.0

In [62]:
df['Age'][1]

38.0

In [66]:
df['Passengerid'][2:7]

2    3
3    4
4    5
5    6
6    7
Name: Passengerid, dtype: int64

In [70]:
df1 = df.iloc[0:10, 0:4]

In [71]:
df1

   Passengerid   Age     Fare  Sex
0            1  22.0   7.2500    0
1            2  38.0  71.2833    1
2            3  26.0   7.9250    1
3            4  35.0  53.1000    1
4            5  35.0   8.0500    0
5            6  28.0   8.4583    0
6            7  54.0  51.8625    0
7            8   2.0  21.0750    0
8            9  27.0  11.1333    1
9           10  14.0  30.0708    1

In [79]:
df2 = df[['Passengerid', 'Age', 'Fare', 'Sex']][0:10]

In [80]:
df2

   Passengerid   Age     Fare  Sex
0            1  22.0   7.2500    0
1            2  38.0  71.2833    1
2            3  26.0   7.9250    1
3            4  35.0  53.1000    1
4            5  35.0   8.0500    0
5            6  28.0   8.4583    0
6            7  54.0  51.8625    0
7            8   2.0  21.0750    0
8            9  27.0  11.1333    1
9           10  14.0  30.0708    1

In [83]:
df3 = df.loc[0:10, 'Passengerid':'Sex']

In [84]:
df3

    Passengerid   Age     Fare  Sex
0             1  22.0   7.2500    0
1             2  38.0  71.2833    1
2             3  26.0   7.9250    1
3             4  35.0  53.1000    1
4             5  35.0   8.0500    0
5             6  28.0   8.4583    0
6             7  54.0  51.8625    0
7             8   2.0  21.0750    0
8             9  27.0  11.1333    1
9            10  14.0  30.0708    1
10           11   4.0  16.7000    1

### Parameters

In [90]:
df_header = pd.read_csv(r'C:\Users\ABBAS\Desktop\JupyterPython\CSV_Files\train_and_test2.csv', header=None);

In [94]:
df_header

,0,1,2,3,4,5,6,7,8,9,...,18,19,20,21,22,23,24,25,26,27
0,Passengerid,Age,Fare,Sex,sibsp,zero,zero,zero,zero,zero,...,zero,zero,zero,Pclass,zero,zero,Embarked,zero,zero,2urvived
1,1,22,7.25,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,0
2,2,38,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,1
3,3,26,7.925,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,1
4,4,35,53.1,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2,0,0,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,1305,28,8.05,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,0
1306,1306,39,108.9,1,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
1307,1307,38.5,7.25,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,0
1308,1308,28,8.05,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,0
1309,1309,28,22.3583,0,1,0,0,0,0,0,...,0,0,0,3,0,0,0,0,0,0

In [92]:
df_usecols = pd.read_csv(r'C:\Users\ABBAS\Desktop\JupyterPython\CSV_Files\train_and_test2.csv', usecols=['Passengerid','Age','Fare', 'Sex', 'zero.5']);

In [93]:
df_usecols

      Passengerid   Age      Fare  Sex  zero.5
0               1  22.0    7.2500    0       0
1               2  38.0   71.2833    1       0
2               3  26.0    7.9250    1       0
3               4  35.0   53.1000    1       0
4               5  35.0    8.0500    0       0
...           ...   ...       ...  ...     ...
1304         1305  28.0    8.0500    0       0
1305         1306  39.0  108.9000    1       0
1306         1307  38.5    7.2500    0       0
1307         1308  28.0    8.0500    0       0
1308         1309  28.0   22.3583    0       0

[1309 rows x 5 columns]

In [97]:
df_header.loc[0:10, 0:10]

             0    1        2    3      4     5     6     7     8     9     10
0   Passengerid  Age     Fare  Sex  sibsp  zero  zero  zero  zero  zero  zero
1             1   22     7.25    0      1     0     0     0     0     0     0
2             2   38  71.2833    1      1     0     0     0     0     0     0
3             3   26    7.925    1      0     0     0     0     0     0     0
4             4   35     53.1    1      1     0     0     0     0     0     0
5             5   35     8.05    0      0     0     0     0     0     0     0
6             6   28   8.4583    0      0     0     0     0     0     0     0
7             7   54  51.8625    0      0     0     0     0     0     0     0
8             8    2   21.075    0      3     0     0     0     0     0     0
9             9   27  11.1333    1      0     0     0     0     0     0     0
10           10   14  30.0708    1      1     0     0     0     0     0     0

In [98]:
df_index_col = pd.read_csv(r'C:\Users\ABBAS\Desktop\JupyterPython\CSV_Files\train_and_test2.csv', index_col='Passengerid')

In [99]:
df_index_col

,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
Passengerid,,,,,,,,,,,,,,,,,,,,,
1,22.0,7.2500,0,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
2,38.0,71.2833,1,1,0,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
3,26.0,7.9250,1,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
4,35.0,53.1000,1,1,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
5,35.0,8.0500,0,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,28.0,8.0500,0,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1306,39.0,108.9000,1,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,0
1307,38.5,7.2500,0,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1308,28.0,8.0500,0,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1309,28.0,22.3583,0,1,0,0,0,0,0,0,...,0,0,0,3,0,0,0.0,0,0,0

### Reading a file with bultin function open() and making a df frame of it

In [117]:
with open('csv_like_file.txt', 'r') as file:
    for line in file:
        print(line)

P_id	Age	Fare	Sex	sibsp	zero	zero	zero	zero	zero	zero

1	22	7.25	0	1	0	0	0	0	0	0

2	38	71.2833	1	1	0	0	0	0	0	0

3	26	7.925	1	0	0	0	0	0	0	0

4	35	53.1	1	1	0	0	0	0	0	0

5	35	8.05	0	0	0	0	0	0	0	0

6	28	8.4583	0	0	0	0	0	0	0	0

7	54	51.8625	0	0	0	0	0	0	0	0

8	2	21.075	0	3	0	0	0	0	0	0

9	27	11.1333	1	0	0	0	0	0	0	0

10	14	30.0708	1	1	0	0	0	0	0	0

In [120]:
with open('csv_like_file.txt', 'r') as file:
    df_open = pd.read_csv(file, sep='\t');

In [121]:
df_open

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [122]:
with open('csv_like_file.txt', 'r') as file:
    df_open = pd.read_csv(file, delimiter='\t');

In [123]:
df_open

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

### The header parameter 
- int, Sequence of int, ‘infer’ or None, default ‘infer’

In [125]:
df = pd.read_csv('csv_like_file.txt', header=0, sep='\t');
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [126]:
df = pd.read_csv('csv_like_file.txt', header=None, sep='\t');
df

      0    1        2    3      4     5     6     7     8     9     10
0   P_id  Age     Fare  Sex  sibsp  zero  zero  zero  zero  zero  zero
1      1   22     7.25    0      1     0     0     0     0     0     0
2      2   38  71.2833    1      1     0     0     0     0     0     0
3      3   26    7.925    1      0     0     0     0     0     0     0
4      4   35     53.1    1      1     0     0     0     0     0     0
5      5   35     8.05    0      0     0     0     0     0     0     0
6      6   28   8.4583    0      0     0     0     0     0     0     0
7      7   54  51.8625    0      0     0     0     0     0     0     0
8      8    2   21.075    0      3     0     0     0     0     0     0
9      9   27  11.1333    1      0     0     0     0     0     0     0
10    10   14  30.0708    1      1     0     0     0     0     0     0

In [128]:
df = pd.read_csv('csv_like_file.txt', header='infer', sep='\t');
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [129]:
df = pd.read_csv('csv_like_file.txt', header=1, delimiter='\t');
df

    1  22     7.25  0  1.1  0.1  0.2  0.3  0.4  0.5  0.6
0   2  38  71.2833  1    1    0    0    0    0    0    0
1   3  26   7.9250  1    0    0    0    0    0    0    0
2   4  35  53.1000  1    1    0    0    0    0    0    0
3   5  35   8.0500  0    0    0    0    0    0    0    0
4   6  28   8.4583  0    0    0    0    0    0    0    0
5   7  54  51.8625  0    0    0    0    0    0    0    0
6   8   2  21.0750  0    3    0    0    0    0    0    0
7   9  27  11.1333  1    0    0    0    0    0    0    0
8  10  14  30.0708  1    1    0    0    0    0    0    0

In [132]:
df = pd.read_csv('csv_like_file.txt', header=1, delimiter='\t', skip_blank_lines=False);  # The 'csv_like_file.txt' contain 
df                                                                                         # first blank line

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [134]:
df = pd.read_csv('csv_like_file.txt', header=0, sep='\t', skip_blank_lines=False);
df

Empty DataFrame
Columns: []
Index: [(P_id, Age, Fare, Sex, sibsp, zero, zero, zero, zero, zero, zero), (1, 22, 7.25, 0, 1, 0, 0, 0, 0, 0, 0), (2, 38, 71.2833, 1, 1, 0, 0, 0, 0, 0, 0), (3, 26, 7.925, 1, 0, 0, 0, 0, 0, 0, 0), (4, 35, 53.1, 1, 1, 0, 0, 0, 0, 0, 0), (5, 35, 8.05, 0, 0, 0, 0, 0, 0, 0, 0), (6, 28, 8.4583, 0, 0, 0, 0, 0, 0, 0, 0), (7, 54, 51.8625, 0, 0, 0, 0, 0, 0, 0, 0), (8, 2, 21.075, 0, 3, 0, 0, 0, 0, 0, 0), (9, 27, 11.1333, 1, 0, 0, 0, 0, 0, 0, 0), (10, 14, 30.0708, 1, 1, 0, 0, 0, 0, 0, 0)]

In [138]:
df = pd.read_csv('csv_like_file.txt', names=['p_id','age','fare','sex','sibsp','zero1','zero2','zero3','zero4','zero5','zero6'],sep='\t');
df

    p_id  age     fare  sex  sibsp zero1 zero2 zero3 zero4 zero5 zero6
0   P_id  Age     Fare  Sex  sibsp  zero  zero  zero  zero  zero  zero
1      1   22     7.25    0      1     0     0     0     0     0     0
2      2   38  71.2833    1      1     0     0     0     0     0     0
3      3   26    7.925    1      0     0     0     0     0     0     0
4      4   35     53.1    1      1     0     0     0     0     0     0
5      5   35     8.05    0      0     0     0     0     0     0     0
6      6   28   8.4583    0      0     0     0     0     0     0     0
7      7   54  51.8625    0      0     0     0     0     0     0     0
8      8    2   21.075    0      3     0     0     0     0     0     0
9      9   27  11.1333    1      0     0     0     0     0     0     0
10    10   14  30.0708    1      1     0     0     0     0     0     0

In [141]:
df = pd.read_csv('csv_like_file.txt', names=['p_id','sex','sibsp','zero1','zero2','zero3','zero4','zero5','zero6'],sep='\t');
df

             p_id  sex  sibsp zero1 zero2 zero3 zero4 zero5 zero6
P_id Age     Fare  Sex  sibsp  zero  zero  zero  zero  zero  zero
1    22      7.25    0      1     0     0     0     0     0     0
2    38   71.2833    1      1     0     0     0     0     0     0
3    26     7.925    1      0     0     0     0     0     0     0
4    35      53.1    1      1     0     0     0     0     0     0
5    35      8.05    0      0     0     0     0     0     0     0
6    28    8.4583    0      0     0     0     0     0     0     0
7    54   51.8625    0      0     0     0     0     0     0     0
8    2     21.075    0      3     0     0     0     0     0     0
9    27   11.1333    1      0     0     0     0     0     0     0
10   14   30.0708    1      1     0     0     0     0     0     0

In [143]:
df = pd.read_csv('csv_like_file.txt', header=None, names=['p_id','age','fare','sex','sibsp','zero1','zero2','zero3','zero4','zero5','zero6'],sep='\t');
df

    p_id  age     fare  sex  sibsp zero1 zero2 zero3 zero4 zero5 zero6
0   P_id  Age     Fare  Sex  sibsp  zero  zero  zero  zero  zero  zero
1      1   22     7.25    0      1     0     0     0     0     0     0
2      2   38  71.2833    1      1     0     0     0     0     0     0
3      3   26    7.925    1      0     0     0     0     0     0     0
4      4   35     53.1    1      1     0     0     0     0     0     0
5      5   35     8.05    0      0     0     0     0     0     0     0
6      6   28   8.4583    0      0     0     0     0     0     0     0
7      7   54  51.8625    0      0     0     0     0     0     0     0
8      8    2   21.075    0      3     0     0     0     0     0     0
9      9   27  11.1333    1      0     0     0     0     0     0     0
10    10   14  30.0708    1      1     0     0     0     0     0     0

In [146]:
#  Explicitly pass header=0 to be able to replace existing names.
df = pd.read_csv('csv_like_file.txt', header=0, names=['p_id','age','fare','sex','sibsp','zero1','zero2','zero3','zero4','zero5','zero6'], sep='\t');
df

   p_id  age     fare  sex  sibsp  zero1  zero2  zero3  zero4  zero5  zero6
0     1   22   7.2500    0      1      0      0      0      0      0      0
1     2   38  71.2833    1      1      0      0      0      0      0      0
2     3   26   7.9250    1      0      0      0      0      0      0      0
3     4   35  53.1000    1      1      0      0      0      0      0      0
4     5   35   8.0500    0      0      0      0      0      0      0      0
5     6   28   8.4583    0      0      0      0      0      0      0      0
6     7   54  51.8625    0      0      0      0      0      0      0      0
7     8    2  21.0750    0      3      0      0      0      0      0      0
8     9   27  11.1333    1      0      0      0      0      0      0      0
9    10   14  30.0708    1      1      0      0      0      0      0      0

### The names Parameter
- Sequence of Hashable, optional

In [148]:
df = pd.read_csv('csv_like_file.txt', header=0, sep='\t');
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [149]:
df = pd.read_csv('csv_like_file.txt', header=None, names=['p_id','age','fare','sex','sibsp','zero1','zero2','zero3','zero4','zero5','zero6'], sep='\t');
df

    p_id  age     fare  sex  sibsp zero1 zero2 zero3 zero4 zero5 zero6
0   P_id  Age     Fare  Sex  sibsp  zero  zero  zero  zero  zero  zero
1      1   22     7.25    0      1     0     0     0     0     0     0
2      2   38  71.2833    1      1     0     0     0     0     0     0
3      3   26    7.925    1      0     0     0     0     0     0     0
4      4   35     53.1    1      1     0     0     0     0     0     0
5      5   35     8.05    0      0     0     0     0     0     0     0
6      6   28   8.4583    0      0     0     0     0     0     0     0
7      7   54  51.8625    0      0     0     0     0     0     0     0
8      8    2   21.075    0      3     0     0     0     0     0     0
9      9   27  11.1333    1      0     0     0     0     0     0     0
10    10   14  30.0708    1      1     0     0     0     0     0     0

In [151]:
#  If the file contains a header row, then you should explicitly pass header=0 to override the column names.

df = pd.read_csv('csv_like_file.txt', header=0, names=['p_id','age','fare','sex','sibsp','zero1','zero2','zero3','zero4','zero5','zero6'], sep='\t');
df

   p_id  age     fare  sex  sibsp  zero1  zero2  zero3  zero4  zero5  zero6
0     1   22   7.2500    0      1      0      0      0      0      0      0
1     2   38  71.2833    1      1      0      0      0      0      0      0
2     3   26   7.9250    1      0      0      0      0      0      0      0
3     4   35  53.1000    1      1      0      0      0      0      0      0
4     5   35   8.0500    0      0      0      0      0      0      0      0
5     6   28   8.4583    0      0      0      0      0      0      0      0
6     7   54  51.8625    0      0      0      0      0      0      0      0
7     8    2  21.0750    0      3      0      0      0      0      0      0
8     9   27  11.1333    1      0      0      0      0      0      0      0
9    10   14  30.0708    1      1      0      0      0      0      0      0

### The index_col Parameter
- Hashable Sequence of Hashable or False, optional

In [154]:
df = pd.read_csv('csv_like_file.txt', sep='\t', index_col='P_id');
df

      Age     Fare  Sex  sibsp  zero  zero.1  zero.2  zero.3  zero.4  zero.5
P_id
1      22   7.2500    0      1     0       0       0       0       0       0
2      38  71.2833    1      1     0       0       0       0       0       0
3      26   7.9250    1      0     0       0       0       0       0       0
4      35  53.1000    1      1     0       0       0       0       0       0
5      35   8.0500    0      0     0       0       0       0       0       0
6      28   8.4583    0      0     0       0       0       0       0       0
7      54  51.8625    0      0     0       0       0       0       0       0
8       2  21.0750    0      3     0       0       0       0       0       0
9      27  11.1333    1      0     0       0       0       0       0       0
10     14  30.0708    1      1     0       0       0       0       0       0

In [158]:
df = pd.read_csv('csv_like_file.txt', sep='\t', index_col=0);
df

      Age     Fare  Sex  sibsp  zero  zero.1  zero.2  zero.3  zero.4  zero.5
P_id
1      22   7.2500    0      1     0       0       0       0       0       0
2      38  71.2833    1      1     0       0       0       0       0       0
3      26   7.9250    1      0     0       0       0       0       0       0
4      35  53.1000    1      1     0       0       0       0       0       0
5      35   8.0500    0      0     0       0       0       0       0       0
6      28   8.4583    0      0     0       0       0       0       0       0
7      54  51.8625    0      0     0       0       0       0       0       0
8       2  21.0750    0      3     0       0       0       0       0       0
9      27  11.1333    1      0     0       0       0       0       0       0
10     14  30.0708    1      1     0       0       0       0       0       0

In [2]:
df = pd.read_csv('csv_like_file.txt', sep='\t', index_col=[0,1,2]);
df

                  Sex  sibsp  zero  zero.1  zero.2  zero.3  zero.4  zero.5
P_id Age Fare
1    22  7.2500     0      1     0       0       0       0       0       0
2    38  71.2833    1      1     0       0       0       0       0       0
3    26  7.9250     1      0     0       0       0       0       0       0
4    35  53.1000    1      1     0       0       0       0       0       0
5    35  8.0500     0      0     0       0       0       0       0       0
6    28  8.4583     0      0     0       0       0       0       0       0
7    54  51.8625    0      0     0       0       0       0       0       0
8    2   21.0750    0      3     0       0       0       0       0       0
9    27  11.1333    1      0     0       0       0       0       0       0
10   14  30.0708    1      1     0       0       0       0       0       0

In [3]:
pd.read_csv('csv_like_file.txt', sep='\t', index_col=False)

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

### The usecols Parameter
- list of Hashable or Callable, optional

In [2]:
df = pd.read_csv("csv_like_file.txt", sep='\t', usecols=['P_id', 'Age', 'Fare', 'Sex']);
df

   P_id  Age     Fare  Sex
0     1   22   7.2500    0
1     2   38  71.2833    1
2     3   26   7.9250    1
3     4   35  53.1000    1
4     5   35   8.0500    0
5     6   28   8.4583    0
6     7   54  51.8625    0
7     8    2  21.0750    0
8     9   27  11.1333    1
9    10   14  30.0708    1

In [3]:
df = pd.read_csv('csv_like_file.txt', sep="\t", usecols=[0,1,2,3,4]);
df

   P_id  Age     Fare  Sex  sibsp
0     1   22   7.2500    0      1
1     2   38  71.2833    1      1
2     3   26   7.9250    1      0
3     4   35  53.1000    1      1
4     5   35   8.0500    0      0
5     6   28   8.4583    0      0
6     7   54  51.8625    0      0
7     8    2  21.0750    0      3
8     9   27  11.1333    1      0
9    10   14  30.0708    1      1

In [5]:
df = pd.read_csv("csv_like_file.txt", sep='\t', usecols=[0,2,4,6,8]); 
df

   P_id     Fare  sibsp  zero.1  zero.3
0     1   7.2500      1       0       0
1     2  71.2833      1       0       0
2     3   7.9250      0       0       0
3     4  53.1000      1       0       0
4     5   8.0500      0       0       0
5     6   8.4583      0       0       0
6     7  51.8625      0       0       0
7     8  21.0750      3       0       0
8     9  11.1333      0       0       0
9    10  30.0708      1       0       0

In [6]:
df = pd.read_csv("csv_like_file.txt", sep='\t', usecols=[5,4,3,2,1,0]);
df

   P_id  Age     Fare  Sex  sibsp  zero
0     1   22   7.2500    0      1     0
1     2   38  71.2833    1      1     0
2     3   26   7.9250    1      0     0
3     4   35  53.1000    1      1     0
4     5   35   8.0500    0      0     0
5     6   28   8.4583    0      0     0
6     7   54  51.8625    0      0     0
7     8    2  21.0750    0      3     0
8     9   27  11.1333    1      0     0
9    10   14  30.0708    1      1     0

In [8]:
# To preserve the order

df = pd.read_csv("csv_like_file.txt", sep='\t', usecols=[5,4,3,2,1,0])[['zero','sibsp','Sex','Fare','Age','P_id']];
df

   zero  sibsp  Sex     Fare  Age  P_id
0     0      1    0   7.2500   22     1
1     0      1    1  71.2833   38     2
2     0      0    1   7.9250   26     3
3     0      1    1  53.1000   35     4
4     0      0    0   8.0500   35     5
5     0      0    0   8.4583   28     6
6     0      0    0  51.8625   54     7
7     0      3    0  21.0750    2     8
8     0      0    1  11.1333   27     9
9     0      1    1  30.0708   14    10

In [11]:
df = pd.read_csv("csv_like_file.txt", sep='\t', usecols=[5,4,3,2,1,0]).iloc[:, 5::-1];
df

   zero  sibsp  Sex     Fare  Age  P_id
0     0      1    0   7.2500   22     1
1     0      1    1  71.2833   38     2
2     0      0    1   7.9250   26     3
3     0      1    1  53.1000   35     4
4     0      0    0   8.0500   35     5
5     0      0    0   8.4583   28     6
6     0      0    0  51.8625   54     7
7     0      3    0  21.0750    2     8
8     0      0    1  11.1333   27     9
9     0      1    1  30.0708   14    10

In [12]:
df = pd.read_csv("csv_like_file.txt", sep='\t', usecols=[5,4,3,2,1,0]).loc[:, 'zero':'P_id':-1];
df

   zero  sibsp  Sex     Fare  Age  P_id
0     0      1    0   7.2500   22     1
1     0      1    1  71.2833   38     2
2     0      0    1   7.9250   26     3
3     0      1    1  53.1000   35     4
4     0      0    0   8.0500   35     5
5     0      0    0   8.4583   28     6
6     0      0    0  51.8625   54     7
7     0      3    0  21.0750    2     8
8     0      0    1  11.1333   27     9
9     0      1    1  30.0708   14    10

In [8]:
# Callable 

df = pd.read_csv("csv_like_file.txt", sep='\t', usecols=(lambda x: x in ['P_id','Age','Sex']));
df

   P_id  Age  Sex
0     1   22    0
1     2   38    1
2     3   26    1
3     4   35    1
4     5   35    0
5     6   28    0
6     7   54    0
7     8    2    0
8     9   27    1
9    10   14    1

### The dtype Parameter
- dtype or dict of {Hashabledtype}, optional

In [20]:
df['P_id'].dtype

dtype('int64')

In [21]:
df.dtypes

P_id      int64
Age       int64
Fare    float64
Sex       int64
zero      int64
dtype: object

In [26]:
df = pd.read_csv('csv_like_file.txt', sep='\t', usecols=[0,1,2,3,4], dtype={'P_id':'i4', 'Age':np.intc, 'Fare':np.single, 'Sex':'b', 'sibsp':'b'} );
df

   P_id  Age       Fare  Sex  sibsp
0     1   22   7.250000    0      1
1     2   38  71.283302    1      1
2     3   26   7.925000    1      0
3     4   35  53.099998    1      1
4     5   35   8.050000    0      0
5     6   28   8.458300    0      0
6     7   54  51.862499    0      0
7     8    2  21.075001    0      3
8     9   27  11.133300    1      0
9    10   14  30.070801    1      1

In [27]:
df.dtypes

P_id       int32
Age        int32
Fare     float32
Sex         int8
sibsp       int8
dtype: object

In [28]:
df.size

50

In [29]:
df.shape

(10, 5)

In [33]:
df = pd.read_csv('csv_like_file.txt', sep='\t', usecols=[0,1,2,3], dtype=np.unicode_);
df

  P_id Age     Fare Sex
0    1  22     7.25   0
1    2  38  71.2833   1
2    3  26    7.925   1
3    4  35     53.1   1
4    5  35     8.05   0
5    6  28   8.4583   0
6    7  54  51.8625   0
7    8   2   21.075   0
8    9  27  11.1333   1
9   10  14  30.0708   1

In [34]:
df.dtypes

P_id    object
Age     object
Fare    object
Sex     object
dtype: object

### The  engine Parameter
- {‘c’, ‘python’, ‘pyarrow’}, optional
- Parser engine to use.

In [42]:
df = pd.read_csv("csv_like_file.txt", delimiter='\t', engine='c');
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [44]:
df = pd.read_csv("csv_like_file.txt", delimiter='\t', engine='python');
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [40]:
df.dtypes

P_id        int64
Age         int64
Fare      float64
Sex         int64
sibsp       int64
zero        int64
zero.1      int64
zero.2      int64
zero.3      int64
zero.4      int64
zero.5      int64
dtype: object

In [39]:
#df = pd.read_csv("csv_like_file.txt", delimiter='\t', engine='pyarrow');
#df

### The converters Parameter
- dict of {HashableCallable}, optional
- Keys can either be column labels or column indices.

In [50]:
df = pd.read_csv('csv_like_file.txt', sep='\t', converters={'Fare': lambda x: float(x)*10});
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,72.500,0,1,0,0,0,0,0,0
1,2,38,712.833,1,1,0,0,0,0,0,0
2,3,26,79.250,1,0,0,0,0,0,0,0
3,4,35,531.000,1,1,0,0,0,0,0,0
4,5,35,80.500,0,0,0,0,0,0,0,0
5,6,28,84.583,0,0,0,0,0,0,0,0
6,7,54,518.625,0,0,0,0,0,0,0,0
7,8,2,210.750,0,3,0,0,0,0,0,0
8,9,27,111.333,1,0,0,0,0,0,0,0
9,10,14,300.708,1,1,0,0,0,0,0,0

In [10]:
fare_ctr = lambda x: float(x)*10;
age_ctr = lambda x: int(x)+10;

df = pd.read_csv('csv_like_file.txt', sep='\t', converters={'Age':age_ctr, 'Fare':fare_ctr});
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,32,72.500,0,1,0,0,0,0,0,0
1,2,48,712.833,1,1,0,0,0,0,0,0
2,3,36,79.250,1,0,0,0,0,0,0,0
3,4,45,531.000,1,1,0,0,0,0,0,0
4,5,45,80.500,0,0,0,0,0,0,0,0
5,6,38,84.583,0,0,0,0,0,0,0,0
6,7,64,518.625,0,0,0,0,0,0,0,0
7,8,12,210.750,0,3,0,0,0,0,0,0
8,9,37,111.333,1,0,0,0,0,0,0,0
9,10,24,300.708,1,1,0,0,0,0,0,0

In [53]:
fare_ctr = lambda x: float(x)*10;
age_ctr = lambda x: int(x)+10;

ctrs = {'Age':age_ctr, 'Fare':fare_ctr};

df = pd.read_csv('csv_like_file.txt', sep='\t', converters=ctrs);
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,32,72.500,0,1,0,0,0,0,0,0
1,2,48,712.833,1,1,0,0,0,0,0,0
2,3,36,79.250,1,0,0,0,0,0,0,0
3,4,45,531.000,1,1,0,0,0,0,0,0
4,5,45,80.500,0,0,0,0,0,0,0,0
5,6,38,84.583,0,0,0,0,0,0,0,0
6,7,64,518.625,0,0,0,0,0,0,0,0
7,8,12,210.750,0,3,0,0,0,0,0,0
8,9,37,111.333,1,0,0,0,0,0,0,0
9,10,24,300.708,1,1,0,0,0,0,0,0

In [54]:
fare_ctr = lambda x: float(x)*10;
age_ctr = lambda x: int(x)+10;

ctrs = {1:age_ctr, 2:fare_ctr};

df = pd.read_csv('csv_like_file.txt', sep='\t', converters=ctrs);
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,32,72.500,0,1,0,0,0,0,0,0
1,2,48,712.833,1,1,0,0,0,0,0,0
2,3,36,79.250,1,0,0,0,0,0,0,0
3,4,45,531.000,1,1,0,0,0,0,0,0
4,5,45,80.500,0,0,0,0,0,0,0,0
5,6,38,84.583,0,0,0,0,0,0,0,0
6,7,64,518.625,0,0,0,0,0,0,0,0
7,8,12,210.750,0,3,0,0,0,0,0,0
8,9,37,111.333,1,0,0,0,0,0,0,0
9,10,24,300.708,1,1,0,0,0,0,0,0

In [3]:
# using converters in datetime 
df = pd.read_csv("Dates_time.csv", parse_dates=[0]);
df

,month_day_year,day_month_year,date_time,year_month_day,Time
0,1996-04-22,22-Apr-96,Tue Aug 11 09:50:35 1996,6/22/2007,9:44:30
1,1996-04-23,23-Apr-96,Tue May 12 19:50:35 2016,1/9/2017,10:44:30
2,1996-05-14,14-May-96,Mon Oct 14 09:50:35 2017,4/12/1998,11:44:30
3,1996-05-15,15-May-96,Tue Jan 11 09:50:35 2018,7/22/2027,12:44:30
4,2001-05-16,16-May-01,Fri Mar 11 07:30:36 2019,11/15/1945,13:44:30
5,2002-05-17,17-May-02,Tue Aug 11 09:50:35 2020,6/22/1942,14:44:30
6,2003-05-18,18-May-03,Wed Dec 21 09:50:35 2021,1887-06-13,15:44:30
7,2004-05-19,19-May-04,Tue Jan 11 09:50:35 2022,1/25/1912,16:44:30
8,2005-05-20,20-May-05,Sun Jul 10 19:40:25 2023,6/22/2007,17:44:30

In [11]:
crtr = lambda date: pd.to_datetime(date, format="%m/%d/%Y");

df = pd.read_csv("Dates_time.csv", converters={0:crtr});
df

,month_day_year,day_month_year,date_time,year_month_day,Time
0,1996-04-22,22-Apr-96,Tue Aug 11 09:50:35 1996,6/22/2007,9:44:30
1,1996-04-23,23-Apr-96,Tue May 12 19:50:35 2016,1/9/2017,10:44:30
2,1996-05-14,14-May-96,Mon Oct 14 09:50:35 2017,4/12/1998,11:44:30
3,1996-05-15,15-May-96,Tue Jan 11 09:50:35 2018,7/22/2027,12:44:30
4,2001-05-16,16-May-01,Fri Mar 11 07:30:36 2019,11/15/1945,13:44:30
5,2002-05-17,17-May-02,Tue Aug 11 09:50:35 2020,6/22/1942,14:44:30
6,2003-05-18,18-May-03,Wed Dec 21 09:50:35 2021,1887-06-13,15:44:30
7,2004-05-19,19-May-04,Tue Jan 11 09:50:35 2022,1/25/1912,16:44:30
8,2005-05-20,20-May-05,Sun Jul 10 19:40:25 2023,6/22/2007,17:44:30

In [12]:
df.dtypes

month_day_year    datetime64[ns]
day_month_year            object
date_time                 object
year_month_day            object
Time                      object
dtype: object

### The true_values Parameter
- list, optional
- list of strings that should be considered as boolean True values.
### The false_values parameter
- list of strings that should be considered as boolean flase vlues.

In [89]:
df = pd.read_csv('csv_like_file.txt', sep='\t', true_values=[str(1)], false_values=[str(0)], dtype={'Sex': str}, skipinitialspace=True);
df

   P_id  Age     Fare Sex  sibsp  zero  zero.1  zero.2  zero.3  zero.4  zero.5
0     1   22   7.2500   0      1     0       0       0       0       0       0
1     2   38  71.2833   1      1     0       0       0       0       0       0
2     3   26   7.9250   1      0     0       0       0       0       0       0
3     4   35  53.1000   1      1     0       0       0       0       0       0
4     5   35   8.0500   0      0     0       0       0       0       0       0
5     6   28   8.4583   0      0     0       0       0       0       0       0
6     7   54  51.8625   0      0     0       0       0       0       0       0
7     8    2  21.0750   0      3     0       0       0       0       0       0
8     9   27  11.1333   1      0     0       0       0       0       0       0
9    10   14  30.0708   1      1     0       0       0       0       0       0

In [88]:
df.dtypes

P_id        int64
Age         int64
Fare      float64
Sex        object
sibsp       int64
zero        int64
zero.1      int64
zero.2      int64
zero.3      int64
zero.4      int64
zero.5      int64
dtype: object

In [65]:
csv_data = """
Name,IsStudent
Alice,Yes
Bob,True
Charlie,1
David,on
Eva,No
""";

df = pd.read_csv(StringIO(csv_data), true_values=['Yes','True','1','on'], false_values=['No']);
df

      Name  IsStudent
0    Alice       True
1      Bob       True
2  Charlie       True
3    David       True
4      Eva      False

In [80]:
df = pd.read_csv('true_false_file.txt', true_values=['Yes','1','Y','y','yes','on'], false_values=['No','N','no','0','off','Off']);
df

       Name   Age   Applied
0    hassan    23      True
1     abbas    20      True
2     akram    30     False
3     usman    22     False
4    waleed    33      True
5     sajid    32     False
6    kausar    22      True
7    zubair    24      True
8   wajahar    28     False
9    kareem    21     False
10    noman    23      True
11   shahid    24     False

In [81]:
df.dtypes

Name        object
 Age         int64
 Applied      bool
dtype: object

In [84]:
df = pd.read_csv('true_false_file.txt', true_values=['Yes','1','Y','y','yes','on'], false_values=['No','N','no','0','off','Off'], skipinitialspace=True);
df

       Name  Age  Applied
0    hassan   23     True
1     abbas   20     True
2     akram   30    False
3     usman   22    False
4    waleed   33     True
5     sajid   32    False
6    kausar   22     True
7    zubair   24     True
8   wajahar   28    False
9    kareem   21    False
10    noman   23     True
11   shahid   24    False

### skipinitialspace
- bool, default False
- Skip spaces after delimiter.

In [90]:
df = pd.read_csv('true_false_file.txt');
df

       Name   Age  Applied
0    hassan    23      Yes
1     abbas    20      yes
2     akram    30       no
3     usman    22        0
4    waleed    33       on
5     sajid    32      off
6    kausar    22        Y
7    zubair    24     true
8   wajahar    28    false
9    kareem    21        N
10    noman    23        1
11   shahid    24    False

In [124]:
df.iloc[0,2]

' Yes'

In [125]:
len(df.iloc[0,2])

4

In [126]:
df.iloc[-1,2]

' False'

In [127]:
df = pd.read_csv('true_false_file.txt', skipinitialspace=True);
df

       Name  Age Applied
0    hassan   23     Yes
1     abbas   20     yes
2     akram   30      no
3     usman   22       0
4    waleed   33      on
5     sajid   32     off
6    kausar   22       Y
7    zubair   24    true
8   wajahar   28   false
9    kareem   21       N
10    noman   23       1
11   shahid   24   False

In [128]:
df.iloc[0,2]

'Yes'

In [129]:
len(df.iloc[0,2])

3

In [131]:
df.iloc[-1,2]

'False'

### skiprows
- int, list of int or Callable, optional

In [133]:
df = pd.read_csv('csv_like_file.txt', sep='\t');
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [134]:
pd.read_csv('csv_like_file.txt', sep='\t', skiprows=2)

    1  22     7.25  0  1.1  0.1  0.2  0.3  0.4  0.5  0.6
0   2  38  71.2833  1    1    0    0    0    0    0    0
1   3  26   7.9250  1    0    0    0    0    0    0    0
2   4  35  53.1000  1    1    0    0    0    0    0    0
3   5  35   8.0500  0    0    0    0    0    0    0    0
4   6  28   8.4583  0    0    0    0    0    0    0    0
5   7  54  51.8625  0    0    0    0    0    0    0    0
6   8   2  21.0750  0    3    0    0    0    0    0    0
7   9  27  11.1333  1    0    0    0    0    0    0    0
8  10  14  30.0708  1    1    0    0    0    0    0    0

In [135]:
pd.read_csv('csv_like_file.txt',sep='\t', skiprows=1)

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [136]:
pd.read_csv('csv_like_file.txt', sep='\t', skiprows=[0,1,2,3])

    3  26    7.925  1  0  0.1  0.2  0.3  0.4  0.5  0.6
0   4  35  53.1000  1  1    0    0    0    0    0    0
1   5  35   8.0500  0  0    0    0    0    0    0    0
2   6  28   8.4583  0  0    0    0    0    0    0    0
3   7  54  51.8625  0  0    0    0    0    0    0    0
4   8   2  21.0750  0  3    0    0    0    0    0    0
5   9  27  11.1333  1  0    0    0    0    0    0    0
6  10  14  30.0708  1  1    0    0    0    0    0    0

In [137]:
pd.read_csv('csv_like_file.txt', sep='\t', skiprows=[0,2,4,6])

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,2,38,71.2833,1,1,0,0,0,0,0,0
1,4,35,53.1000,1,1,0,0,0,0,0,0
2,6,28,8.4583,0,0,0,0,0,0,0,0
3,7,54,51.8625,0,0,0,0,0,0,0,0
4,8,2,21.0750,0,3,0,0,0,0,0,0
5,9,27,11.1333,1,0,0,0,0,0,0,0
6,10,14,30.0708,1,1,0,0,0,0,0,0

In [138]:
pd.read_csv('csv_like_file.txt', sep='\t', skiprows=lambda x: x%2==0)

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,2,38,71.2833,1,1,0,0,0,0,0,0
1,4,35,53.1000,1,1,0,0,0,0,0,0
2,6,28,8.4583,0,0,0,0,0,0,0,0
3,8,2,21.0750,0,3,0,0,0,0,0,0
4,10,14,30.0708,1,1,0,0,0,0,0,0

In [151]:
pd.read_csv('csv_like_file.txt', sep='\t', skiprows=lambda x: x in [1,2,5,7,8])

    2  38  71.2833  1  1.1  0  0.1  0.2  0.3  0.4  0.5
0   3  26   7.9250  1    0  0    0    0    0    0    0
1   5  35   8.0500  0    0  0    0    0    0    0    0
2   8   2  21.0750  0    3  0    0    0    0    0    0
3   9  27  11.1333  1    0  0    0    0    0    0    0
4  10  14  30.0708  1    1  0    0    0    0    0    0

### skipfooter 
- int, default 0
- Number of lines at bottom of file to skip (Unsupported with engine='c').

In [153]:
df = pd.read_csv('csv_like_file.txt', sep='\t');
df

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [155]:
pd.read_csv('csv_like_file.txt', sep='\t', skipfooter=4)

C:\Users\ABBAS\AppData\Local\Temp\ipykernel_1828\2781511894.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  pd.read_csv('csv_like_file.txt', sep='\t', skipfooter=4)

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0

In [157]:
pd.read_csv('csv_like_file.txt', sep='\t', skipfooter=4, engine='python')

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0

### nrows
- int, optional
- Number of rows of file to read. Useful for reading pieces of large files.

In [160]:
df = pd.read_csv(r'C:\Users\ABBAS\Desktop\JupyterPython\CSV_Files\train_and_test2.csv', nrows=8);
df

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,1
2,3,26,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,1
3,4,35,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2,0,0,1
4,5,35,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,...,0,0,0,1,0,0,2,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,...,0,0,0,3,0,0,2,0,0,0

In [162]:
df = pd.read_csv(r'C:\Users\ABBAS\Desktop\JupyterPython\CSV_Files\train_and_test2.csv').iloc[0:10, 0:5];
df

   Passengerid   Age     Fare  Sex  sibsp
0            1  22.0   7.2500    0      1
1            2  38.0  71.2833    1      1
2            3  26.0   7.9250    1      0
3            4  35.0  53.1000    1      1
4            5  35.0   8.0500    0      0
5            6  28.0   8.4583    0      0
6            7  54.0  51.8625    0      0
7            8   2.0  21.0750    0      3
8            9  27.0  11.1333    1      0
9           10  14.0  30.0708    1      1

### na_values
- Hashable, Iterable of Hashable or dict of {HashableIterable}, optional
- Additional strings to recognize as NA/NaN.

In [22]:
df = pd.read_csv('Employee.csv')[0:10];
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,No,2,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
5,Bachelors,2016,Bangalore,3,22,Male,No,0,NaN
6,Bachelors,2015,NaN,3,38,Male,No,0,0.0
7,NaN,2016,Bangalore,3,34,Female,No,2,1.0
8,Bachelors,2016,Pune,3,23,NaN,No,1,0.0
9,Masters,2017,New Delhi,2,37,Male,No,2,0.0

In [13]:
df.dtypes

Education                     object
JoiningYear                    int64
City                          object
PaymentTier                    int64
Age                            int64
Gender                        object
EverBenched                   object
ExperienceInCurrentDomain      int64
LeaveOrNot                   float64
dtype: object

In [16]:
df = pd.read_csv("Employee.csv", na_values=[',',' '])[0:10];
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,NaN,3,34,Male,No,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,No,2,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
5,Bachelors,2016,Bangalore,3,22,Male,No,0,NaN
6,Bachelors,2015,NaN,3,38,Male,No,0,0.0
7,NaN,2016,Bangalore,3,34,Female,No,2,1.0
8,Bachelors,2016,Pune,3,23,NaN,No,1,0.0
9,Masters,2017,New Delhi,2,37,Male,No,2,0.0

In [18]:
df = pd.read_csv("Employee.csv", na_values=[',','Male'])[0:10];
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,NaN,3,34,NaN,No,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,No,2,0.0
3,Masters,2016,Bangalore,3,27,NaN,No,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
5,Bachelors,2016,Bangalore,3,22,NaN,No,0,NaN
6,Bachelors,2015,NaN,3,38,NaN,No,0,0.0
7,NaN,2016,Bangalore,3,34,Female,No,2,1.0
8,Bachelors,2016,Pune,3,23,NaN,No,1,0.0
9,Masters,2017,New Delhi,2,37,NaN,No,2,0.0

In [19]:
df = pd.read_csv("Employee.csv", na_values=[',', 1])[0:10];
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,NaN,3.0,34,Male,No,0.0,0.0
1,Bachelors,2013,Pune,NaN,28,Female,NaN,3.0,NaN
2,Null,2014,NaN,3.0,38,NaN,No,2.0,0.0
3,Masters,2016,Bangalore,3.0,27,Male,No,5.0,NaN
4,Masters,2017,Pune,3.0,24,NaN,Yes,2.0,NaN
5,Bachelors,2016,Bangalore,3.0,22,Male,No,0.0,NaN
6,Bachelors,2015,NaN,3.0,38,Male,No,0.0,0.0
7,NaN,2016,Bangalore,3.0,34,Female,No,2.0,NaN
8,Bachelors,2016,Pune,3.0,23,NaN,No,NaN,0.0
9,Masters,2017,New Delhi,2.0,37,Male,No,2.0,0.0

In [20]:
df = pd.read_csv("Employee.csv", na_values={'ExperienceInCurrentDomain':1})[0:10];
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0.0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3.0,1.0
2,Null,2014,NaN,3,38,NaN,No,2.0,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5.0,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2.0,1.0
5,Bachelors,2016,Bangalore,3,22,Male,No,0.0,NaN
6,Bachelors,2015,NaN,3,38,Male,No,0.0,0.0
7,NaN,2016,Bangalore,3,34,Female,No,2.0,1.0
8,Bachelors,2016,Pune,3,23,NaN,No,NaN,0.0
9,Masters,2017,New Delhi,2,37,Male,No,2.0,0.0

In [21]:
df = pd.read_csv("Employee.csv", na_values={'EverBenched':'No'})[0:10];
df

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,NaN,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,NaN,2,0.0
3,Masters,2016,Bangalore,3,27,Male,NaN,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
5,Bachelors,2016,Bangalore,3,22,Male,NaN,0,NaN
6,Bachelors,2015,NaN,3,38,Male,NaN,0,0.0
7,NaN,2016,Bangalore,3,34,Female,NaN,2,1.0
8,Bachelors,2016,Pune,3,23,NaN,NaN,1,0.0
9,Masters,2017,New Delhi,2,37,Male,NaN,2,0.0

### keep_default_na 

- bool, default True

- If keep_default_na is True, and na_values are specified, na_values is appended to the default NaN values used for parsing.

- If keep_default_na is True, and na_values are not specified, only the default NaN values are used for parsing.

- If keep_default_na is False, and na_values are specified, only the NaN values specified na_values are used for parsing.

- If keep_default_na is False, and na_values are not specified, no strings will be parsed as NaN.

- Note that if na_filter is passed in as False, the keep_default_na and na_values parameters will be ignored.

In [25]:
pd.read_csv('Employee.csv', keep_default_na=True, na_values=[',','No'])[0:10]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,NaN,3,34,Male,NaN,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,NaN,2,0.0
3,Masters,2016,Bangalore,3,27,Male,NaN,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
5,Bachelors,2016,Bangalore,3,22,Male,NaN,0,NaN
6,Bachelors,2015,NaN,3,38,Male,NaN,0,0.0
7,NaN,2016,Bangalore,3,34,Female,NaN,2,1.0
8,Bachelors,2016,Pune,3,23,NaN,NaN,1,0.0
9,Masters,2017,New Delhi,2,37,Male,NaN,2,0.0

In [26]:
pd.read_csv('Employee.csv', keep_default_na=True)[0:10]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,No,2,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
5,Bachelors,2016,Bangalore,3,22,Male,No,0,NaN
6,Bachelors,2015,NaN,3,38,Male,No,0,0.0
7,NaN,2016,Bangalore,3,34,Female,No,2,1.0
8,Bachelors,2016,Pune,3,23,NaN,No,1,0.0
9,Masters,2017,New Delhi,2,37,Male,No,2,0.0

In [28]:
pd.read_csv('Employee.csv', keep_default_na=False, na_values=[',','No','Null'])[0:10]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,NaN,3,34,Male,NaN,0,0
1,Bachelors,2013,Pune,1,28,Female,null,3,1
2,NaN,2014,null,3,38,N/A,NaN,2,0
3,Masters,2016,Bangalore,3,27,Male,NaN,5,1
4,Masters,2017,Pune,3,24,NULL,Yes,2,1
5,Bachelors,2016,Bangalore,3,22,Male,NaN,0,
6,Bachelors,2015,NA,3,38,Male,NaN,0,0
7,nan,2016,Bangalore,3,34,Female,NaN,2,1
8,Bachelors,2016,Pune,3,23,,NaN,1,0
9,Masters,2017,New Delhi,2,37,Male,NaN,2,0

In [29]:
pd.read_csv('Employee.csv', keep_default_na=False)[0:10]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,null,3,1
2,Null,2014,null,3,38,N/A,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,NULL,Yes,2,1
5,Bachelors,2016,Bangalore,3,22,Male,No,0,
6,Bachelors,2015,NA,3,38,Male,No,0,0
7,nan,2016,Bangalore,3,34,Female,No,2,1
8,Bachelors,2016,Pune,3,23,,No,1,0
9,Masters,2017,New Delhi,2,37,Male,No,2,0

### na_filter
- used to control whether to detect and filter out missing values (NA/NaN) during the reading of a CSV file.
- Note that if na_filter is passed in as False, the keep_default_na and na_values parameters will be ignored.

In [30]:
pd.read_csv("Employee.csv", na_filter=True)[0:10]

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,No,2,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
5,Bachelors,2016,Bangalore,3,22,Male,No,0,NaN
6,Bachelors,2015,NaN,3,38,Male,No,0,0.0
7,NaN,2016,Bangalore,3,34,Female,No,2,1.0
8,Bachelors,2016,Pune,3,23,NaN,No,1,0.0
9,Masters,2017,New Delhi,2,37,Male,No,2,0.0

In [31]:
pd.read_csv('Employee.csv', na_filter=False)[0:10]           # No changes Origional file

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,null,3,1
2,Null,2014,null,3,38,N/A,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,NULL,Yes,2,1
5,Bachelors,2016,Bangalore,3,22,Male,No,0,
6,Bachelors,2015,NA,3,38,Male,No,0,0
7,nan,2016,Bangalore,3,34,Female,No,2,1
8,Bachelors,2016,Pune,3,23,,No,1,0
9,Masters,2017,New Delhi,2,37,Male,No,2,0

In [32]:
pd.read_csv('Employee.csv', na_filter=False, keep_default_na=True, na_values=[',',' '])[0:10]  # No change Origional file

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,null,3,1
2,Null,2014,null,3,38,N/A,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,NULL,Yes,2,1
5,Bachelors,2016,Bangalore,3,22,Male,No,0,
6,Bachelors,2015,NA,3,38,Male,No,0,0
7,nan,2016,Bangalore,3,34,Female,No,2,1
8,Bachelors,2016,Pune,3,23,,No,1,0
9,Masters,2017,New Delhi,2,37,Male,No,2,0

### verbose
- bool, default False
- Indicate number of NA values placed in non-numeric columns.

In [33]:
pd.read_csv('Employee.csv', verbose=True)

Tokenization took: 1.00 ms
Type conversion took: 1.00 ms
Parser memory cleanup took: 0.00 ms

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,No,2,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
...,...,...,...,...,...,...,...,...,...
94,Bachelors,2014,Bangalore,3,39,Male,No,3,1.0
95,PHD,2018,Bangalore,3,26,Male,No,4,1.0
96,Bachelors,2016,Bangalore,3,31,Female,No,0,0.0
97,Bachelors,2014,Bangalore,3,27,Male,No,5,1.0
98,Bachelors,2014,NaN,3,29,Female,No,0,0.0

In [37]:
pd.read_csv('Employee.csv', verbose=1)

Tokenization took: 1.00 ms
Type conversion took: 0.00 ms
Parser memory cleanup took: 0.00 ms

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,",",3,34,Male,No,0,0.0
1,Bachelors,2013,Pune,1,28,Female,NaN,3,1.0
2,Null,2014,NaN,3,38,NaN,No,2,0.0
3,Masters,2016,Bangalore,3,27,Male,No,5,1.0
4,Masters,2017,Pune,3,24,NaN,Yes,2,1.0
...,...,...,...,...,...,...,...,...,...
94,Bachelors,2014,Bangalore,3,39,Male,No,3,1.0
95,PHD,2018,Bangalore,3,26,Male,No,4,1.0
96,Bachelors,2016,Bangalore,3,31,Female,No,0,0.0
97,Bachelors,2014,Bangalore,3,27,Male,No,5,1.0
98,Bachelors,2014,NaN,3,29,Female,No,0,0.0

### skip_blank_lines
- bool, default True
- If True, skip over blank lines rather than interpreting as NaN values.

In [47]:
pd.read_csv('csv_like_file.txt', sep='\t', skip_blank_lines=True)

,P_id,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,zero.5
0,1,22,7.2500,0,1,0,0,0,0,0,0
1,2,38,71.2833,1,1,0,0,0,0,0,0
2,3,26,7.9250,1,0,0,0,0,0,0,0
3,4,35,53.1000,1,1,0,0,0,0,0,0
4,5,35,8.0500,0,0,0,0,0,0,0,0
5,6,28,8.4583,0,0,0,0,0,0,0,0
6,7,54,51.8625,0,0,0,0,0,0,0,0
7,8,2,21.0750,0,3,0,0,0,0,0,0
8,9,27,11.1333,1,0,0,0,0,0,0,0
9,10,14,30.0708,1,1,0,0,0,0,0,0

In [50]:
pd.read_csv("csv_like_file.txt", sep='\t', header=0, skip_blank_lines=False)  #insert a blank row in csv_like_file

Empty DataFrame
Columns: []
Index: [(P_id, Age, Fare, Sex, sibsp, zero, zero, zero, zero, zero, zero), (1, 22, 7.25, 0, 1, 0, 0, 0, 0, 0, 0), (2, 38, 71.2833, 1, 1, 0, 0, 0, 0, 0, 0), (nan, nan, nan, nan, nan, nan, nan, nan, nan, nan, nan), (3, 26, 7.925, 1, 0, 0, 0, 0, 0, 0, 0), (4, 35, 53.1, 1, 1, 0, 0, 0, 0, 0, 0), (5, 35, 8.05, 0, 0, 0, 0, 0, 0, 0, 0), (6, 28, 8.4583, 0, 0, 0, 0, 0, 0, 0, 0), (7, 54, 51.8625, 0, 0, 0, 0, 0, 0, 0, 0), (8, 2, 21.075, 0, 3, 0, 0, 0, 0, 0, 0), (9, 27, 11.1333, 1, 0, 0, 0, 0, 0, 0, 0), (10, 14, 30.0708, 1, 1, 0, 0, 0, 0, 0, 0)]

In [51]:
#chatGPT
# Create a sample DataFrame
data = {'A': [1, 2, 3, 4, 5],
        'B': [10, 20, 30, 40, 50],
        'C': ['apple', 'banana', 'cherry', 'date', 'elderberry']}

dfg = pd.DataFrame(data)

# Select specific columns
selected_columns = dfg[['A', 'C']]

# Select specific rows based on a condition
selected_rows = dfg[dfg['B'] > 30]

# Slice both rows and columns using .loc[]
sliced_data = dfg.loc[1:3, 'A':'B']

# Slice rows and columns using .iloc[]
sliced_data_by_position = dfg.iloc[1:4, 0:2]

In [52]:
selected_columns

   A           C
0  1       apple
1  2      banana
2  3      cherry
3  4        date
4  5  elderberry

In [53]:
selected_rows

   A   B           C
3  4  40        date
4  5  50  elderberry

In [54]:
sliced_data

   A   B
1  2  20
2  3  30
3  4  40